[
    {"text": "How do I filter for mobile mechanics only in the app? I need someone to come to my location.", "sentiment": "neutral"},
    {"text": "I’d like to know the average wait time for a tow truck in the Chicago area through your platform.", "sentiment": "neutral"},
    {"text": "What are your hours of operation on Saturday?", "sentiment": "neutral"},
    {"text": "Which providers offer brake pad replacement for a 2018 Toyota Camry within 10 miles?", "sentiment": "neutral"},
    {"text": "Can I compare prices for oil changes between different repair shops in my neighborhood?", "sentiment": "neutral"},
    {"text": "I’m curious how provider ratings are calculated.", "sentiment": "neutral"},
    {"text": "Do you support mobile tire repair services, or only in-shop appointments?", "sentiment": "neutral"},
    {"text": "What forms of payment do you accept? Can I pay with Apple Pay or Google Pay?", "sentiment": "neutral"},
    {"text": "Is there a cancellation fee if I need to cancel my booking 30 minutes before the mechanic arrives?", "sentiment": "neutral"},
    {"text": "How do I track the tow truck once it's en route to my location?", "sentiment": "neutral"},
    {"text": "I’d like to save my vehicle’s make, model, and year for faster future bookings.", "sentiment": "neutral"},
    {"text": "What service categories are available—do you offer battery replacements or only brake and oil services?", "sentiment": "neutral"},
    {"text": "Are all providers insured and licensed? How can I verify their credentials?", "sentiment": "neutral"},
    {"text": "I plan to schedule a routine maintenance appointment two weeks in advance.", "sentiment": "neutral"},
    {"text": "Does the app support promotional codes or discounts for first-time users?", "sentiment": "neutral"},
    {"text": "How do I update my payment method if my card expired?", "sentiment": "neutral"},
    {"text": "What happens if the mechanic arrives and the issue is different than I reported?", "sentiment": "neutral"},
    {"text": "Can I see a breakdown of the fees, including platform service fees and provider charges?", "sentiment": "neutral"},
    {"text": "How many providers are typically available in the downtown Seattle area?", "sentiment": "neutral"},
    {"text": "Is there a way to chat directly with the service provider before confirming a booking?", "sentiment": "neutral"},
    {"text": "What does surge pricing mean, and when is it applied?", "sentiment": "neutral"},
    {"text": "Can I request a female mechanic specifically through the platform?", "sentiment": "neutral"},
    {"text": "Do you provide estimated travel time plus service duration in the ETA?", "sentiment": "neutral"},
    {"text": "I want to request expedited service for an oil change.", "sentiment": "neutral"},
    {"text": "Is there an option to rate the provider after the service is complete?", "sentiment": "neutral"},
    {"text": "Can I see providers sorted by price rather than rating?", "sentiment": "neutral"},
    {"text": "Do you offer any warranty or guarantee on the work performed by providers?", "sentiment": "neutral"},
    {"text": "What geographic areas does your platform cover in Southern California?", "sentiment": "neutral"},
    {"text": "Can I book a tow for a motorcycle through the app?", "sentiment": "neutral"},
    {"text": "How do I apply multiple promo codes to the same booking?", "sentiment": "neutral"},
    {"text": "What is your policy on provider no-shows or late arrivals?", "sentiment": "neutral"},
    {"text": "Is it possible to book services outside of standard business hours?", "sentiment": "neutral"},
    {"text": "How do I refer a friend to earn credit on my next service?", "sentiment": "neutral"},
    {"text": "Please notify me when a provider is within 5 minutes of arrival.", "sentiment": "neutral"},
    {"text": "What is the difference between in-shop and mobile mechanic services?", "sentiment": "neutral"},
    {"text": "How can I see detailed service descriptions before booking?", "sentiment": "neutral"},
    {"text": "Is there a limit to how many vehicles I can add to my account?", "sentiment": "neutral"},
    {"text": "I’d prefer to pre-authorize payment before the service to speed up checkout.", "sentiment": "neutral"},
    {"text": "Do you offer towing for heavy trucks or only passenger vehicles?", "sentiment": "neutral"},
    {"text": "How accurate are the price estimates shown in the app?", "sentiment": "neutral"},
    {"text": "Can I get a refund if the service takes longer than estimated?", "sentiment": "neutral"},
    {"text": "Is there live phone support if I need help with my booking?", "sentiment": "neutral"},
    {"text": "How do I update my service location once the provider is en route?", "sentiment": "neutral"},
    {"text": "Does the app provide digital receipts for all completed services?", "sentiment": "neutral"},
    {"text": "Can I rate both the provider and the platform separately?", "sentiment": "neutral"},
    {"text": "How do I change my booking date and time after confirmation?", "sentiment": "neutral"},
    {"text": "Are there additional charges for services on holidays or weekends?", "sentiment": "neutral"},
    {"text": "Where can I view my past booking history and invoices?", "sentiment": "neutral"},
    {"text": "Please show me the providers available for battery replacement in zip code 30301.", "sentiment": "neutral"},
    {"text": "What steps should I follow if I experience issues with payment processing?", "sentiment": "neutral"}
  ]