[
    {"text": "My car died on I-95 just north of Downtown Miami and there's heavy traffic. I need immediate towing—please send someone ASAP, preferably the nearest 5-star provider!", "sentiment": "urgent_negative"},
    {"text": "I'm stuck on Route 66 with no phone signal and my two kids in the back. I need an urgent tow! I saw Mike's Towing has a 4.9 rating—can you dispatch them right now?", "sentiment": "urgent_negative"},
    {"text": "Engine just caught fire under the hood in Brooklyn. Dispatch the nearest mechanic urgently—I’m really worried about safety!", "sentiment": "urgent_negative"},
    {"text": "I’ve been rear-ended at the 5th Avenue intersection in Manhattan. My car won’t start and traffic’s piling up. Please send emergency assistance now!", "sentiment": "urgent_negative"},
    {"text": "Steering locked up on Highway 101 near San Jose at 70 mph. This is an emergency—send roadside service immediately!", "sentiment": "urgent_negative"},
    {"text": "It’s pouring rain and my brakes failed on the bridge in St. Louis. I’m at serious risk—please prioritize my service request!", "sentiment": "urgent_negative"},
    {"text": "Stranded outside a closed gas station in Chicago with zero fuel. This is urgent—need mobile fuel delivery ASAP!", "sentiment": "urgent_negative"},
    {"text": "Car broke down in a dangerous part of Oakland at 2 AM. Please match me with the highest-rated tow provider with the shortest ETA!", "sentiment": "urgent_negative"},
    {"text": "Transmission just died on the freeway near Dallas during rush hour, blocking a lane. Need emergency tow immediately!", "sentiment": "urgent_negative"},
    {"text": "Brake line snapped on a steep hill in Denver. Car is sliding backward—please send emergency roadside assistance now!", "sentiment": "urgent_negative"},
  
    {"text": "I booked a mechanic for an oil change but they never showed up—been waiting over an hour and it’s really frustrating.", "sentiment": "standard_negative"},
    {"text": "Why did your app match me with a 2-star repair shop in Houston? Their prices were higher than advertised and the service was terrible.", "sentiment": "standard_negative"},
    {"text": "The ETA said 15 minutes but my tow truck is now 45 minutes late. What’s going on?", "sentiment": "standard_negative"},
    {"text": "Your platform charged me $150 for a battery replacement in Phoenix, but I found the same service for $100 elsewhere. Overpriced.", "sentiment": "standard_negative"},
    {"text": "I can’t find any shops open after 8 PM in Seattle through your app, even though Yelp shows several options.", "sentiment": "standard_negative"},
    {"text": "I tried canceling a booking before the provider arrived in Chicago, but I was still charged a cancellation fee. That’s unfair.", "sentiment": "standard_negative"},
    {"text": "The mobile mechanic you sent to Atlanta didn’t have the right tool for my tire change. Now I have to wait again.", "sentiment": "standard_negative"},
    {"text": "App keeps crashing when I try to filter providers by rating. Why isn’t this basic feature working?", "sentiment": "standard_negative"},
    {"text": "Provider ratings look outdated—one shop showed 5 stars but gave me poor service in Boston. Misleading.", "sentiment": "standard_negative"},
    {"text": "Your price comparison tool displayed incorrect rates for brake service in Miami, so I ended up overpaying.", "sentiment": "standard_negative"},
  
    {"text": "What providers are available for towing within 10 miles of downtown Portland?", "sentiment": "neutral"},
    {"text": "How do I filter mechanics by customer ratings in the app?", "sentiment": "neutral"},
    {"text": "Can I schedule a routine maintenance slot for next Wednesday around noon?", "sentiment": "neutral"},
    {"text": "What is your average wait time for roadside assistance in suburban Atlanta?", "sentiment": "neutral"},
    {"text": "How do I apply a promo code to my booking on the platform?", "sentiment": "neutral"},
    {"text": "Which service types does your platform support in Los Angeles?", "sentiment": "neutral"},
    {"text": "Can I see a breakdown of service fees and provider fees before confirming?", "sentiment": "neutral"},
    {"text": "Does your platform offer battery replacement services in rural Wisconsin?", "sentiment": "neutral"},
    {"text": "How do I contact the provider after booking for location details?", "sentiment": "neutral"},
    {"text": "Is there a way to save my vehicle information for future bookings?", "sentiment": "neutral"},
  
    {"text": "Thank you for matching me with QuickFix Tow in Dallas—they arrived in 10 minutes and were super professional!", "sentiment": "positive"},
    {"text": "Your app’s rating filter helped me find a 5-star mechanic in Chicago. Repair was fast and affordable—great job!", "sentiment": "positive"},
    {"text": "Booking a tire change through your platform in Seattle was seamless. Technician was friendly and efficient!", "sentiment": "positive"},
    {"text": "I love how your price comparison showed me the best deal for brake pads in Miami. Saved me $30!", "sentiment": "positive"},
    {"text": "Thanks for the clear ETA updates during my roadside assistance in Denver—very reassuring.", "sentiment": "positive"},
    {"text": "Provider Sam’s Mobile Mechanics in Austin did an excellent job on my oil change. Highly recommend!", "sentiment": "positive"},
    {"text": "Your customer support chat resolved my billing question instantly. Great service!", "sentiment": "positive"},
    {"text": "I appreciate the app auto-saving my vehicle details. Makes booking future services so much easier!", "sentiment": "positive"},
    {"text": "The real-time tracking of the tow truck in New York City was spot on. Loved the transparency!", "sentiment": "positive"},
    {"text": "Booking maintenance through your platform in Boston was easy and stress-free. Will use again!", "sentiment": "positive"}
  ]