[
    {"text": "The mechanic your app matched me with charged $50 more than the estimate shown in the app. This isn't the first time this has happened either.", "sentiment": "standard_negative"},
    {"text": "I was quoted $120 for a brake pad replacement but ended up paying $175. Why is your pricing so unreliable?", "sentiment": "standard_negative"},
    {"text": "Your price comparison tool is useless—I still got hit with hidden fees after service was done.", "sentiment": "standard_negative"},
    {"text": "Why does the final bill always exceed what I approved? Feels like you’re bait-and-switching customers.", "sentiment": "standard_negative"},
    {"text": "The surge pricing on a flat tire repair was double the normal rate. That’s a rip-off for a simple service.", "sentiment": "standard_negative"},
    {"text": "I selected the 4.8-rated shop for an oil change, estimated $40, and they charged me $70. Very disappointed.", "sentiment": "standard_negative"},
    {"text": "There are only two mobile mechanics in my area listed, and both have terrible ratings. Expand your network!", "sentiment": "standard_negative"},
    {"text": "Why does your app say no providers available in my suburb when I know there are garages nearby?", "sentiment": "standard_negative"},
    {"text": "I can’t find any towing companies in my zip code 97205. This platform is useless where I live.", "sentiment": "standard_negative"},
    {"text": "Only one repair shop appears in rural Madison County and they’re booked solid for weeks. You need more partners.", "sentiment": "standard_negative"},
    {"text": "App shows no tire repair services in my neighborhood even though several places exist.", "sentiment": "standard_negative"},
    {"text": "I picked a 5-star provider for my transmission repair, but their work was sloppy and slow. False advertising!", "sentiment": "standard_negative"},
    {"text": "The 4.9-star mechanic I booked in Atlanta turned out to be unprofessional and overpriced.", "sentiment": "standard_negative"},
    {"text": "Provider ratings seem fake—my 'top-rated' mobile mechanic didn’t even have the right tools.", "sentiment": "standard_negative"},
    {"text": "Why are low-rated shops always the only ones available? My last booking was with a 2-star garage, and it sucked.", "sentiment": "standard_negative"},
    {"text": "Customer reviews on your app clearly aren't vetted. I got duped by a highly rated shop that did a terrible job.", "sentiment": "standard_negative"},
    {"text": "I asked for a tow but your app matched me with a tire repair service. How is that even possible?", "sentiment": "standard_negative"},
    {"text": "Booking a battery replacement but the provider arrived with only tire tools—completely useless.", "sentiment": "standard_negative"},
    {"text": "App suggested an oil change provider when I needed brake repair. Please fix your matching algorithm.", "sentiment": "standard_negative"},
    {"text": "I requested jump start assistance, but they sent someone to change my oil instead. Useless!", "sentiment": "standard_negative"},
    {"text": "Why did your platform match me with a muffler shop when I needed AC repair? Match accuracy is awful.", "sentiment": "standard_negative"},
    {"text": "My booking was confirmed, then the provider canceled last minute. Now I’m without a mechanic for two days!", "sentiment": "standard_negative"},
    {"text": "Three providers canceled on me within an hour. Are you seriously expecting me to keep rebooking?", "sentiment": "standard_negative"},
    {"text": "Provider asked to reschedule because they 'ran out of parts'. Meanwhile I’m stuck waiting all day.", "sentiment": "standard_negative"},
    {"text": "I scheduled a tow for 7 AM but got a cancellation text at 6:55. Totally unprofessional.", "sentiment": "standard_negative"},
    {"text": "Your platform shows the provider en route, then they cancel without warning. Very frustrating.", "sentiment": "standard_negative"},
    {"text": "I wasted 30 minutes waiting for a mobile mechanic who canceled and never apologized.", "sentiment": "standard_negative"},
    {"text": "The platform fee itself is too high compared to competitors. Why should I pay extra just to book?", "sentiment": "standard_negative"},
    {"text": "Surge pricing slapped a $40 fee on my battery change at 10 AM. That’s ridiculous.", "sentiment": "standard_negative"},
    {"text": "Your convenience fee is 15%—that’s excessive. Losing customers over hidden charges.", "sentiment": "standard_negative"},
    {"text": "I can’t believe you charge a separate booking fee on top of surge. Feels like double dipping.", "sentiment": "standard_negative"},
    {"text": "App added a $20 service fee after I confirmed. Surprise fees are unacceptable.", "sentiment": "standard_negative"},
    {"text": "Provider hasn't responded to messages I sent through the app for over an hour.", "sentiment": "standard_negative"},
    {"text": "Your in-app chat is glitchy—I can’t send my location to the mechanic.", "sentiment": "standard_negative"},
    {"text": "I called the provider's number, but it keeps ringing with no answer. Why offer useless contact info?", "sentiment": "standard_negative"},
    {"text": "Notifications are delayed. I didn’t get the provider’s arrival alert until they were gone.", "sentiment": "standard_negative"},
    {"text": "Chat history resets every time I reopen the app. I lose track of details mid-conversation.", "sentiment": "standard_negative"},
    {"text": "My credit card was charged twice for one oil change booking. Please refund one charge.", "sentiment": "standard_negative"},
    {"text": "I tried to add my debit card and the app kept rejecting it without explanation.", "sentiment": "standard_negative"},
    {"text": "Payment failed at checkout despite using a valid card. Now I can't book any service.", "sentiment": "standard_negative"},
    {"text": "Your saved payment method disappeared and I had to re-enter all info just to pay.", "sentiment": "standard_negative"},
    {"text": "Provider ETA jumped from 10 to 60 minutes in five minutes. That’s completely unreliable.", "sentiment": "standard_negative"},
    {"text": "Your app said tow truck arriving in 15 minutes, but they showed up two hours later.", "sentiment": "standard_negative"},
    {"text": "ETA tracker is broken—provider arrived before app even showed them en route.", "sentiment": "standard_negative"},
    {"text": "You estimated a 20-minute wait for mobile mechanic, but I waited over 90. Terrible accuracy.", "sentiment": "standard_negative"},
    {"text": "The ‘certified’ mechanic you sent couldn’t fix my simple brake issue. Not impressed.", "sentiment": "standard_negative"},
    {"text": "They claimed to be ASE certified but made the noise worse. Credentials seem bogus.", "sentiment": "standard_negative"},
    {"text": "Provider arrived without proper diagnostic equipment. How is that professional?", "sentiment": "standard_negative"},
    {"text": "Your app says providers are vetted, but this one barely knew what they were doing.", "sentiment": "standard_negative"},
    {"text": "I expected a licensed technician, but got a trainee who messed up my alignment.", "sentiment": "standard_negative"}
  ]