[
    {"text": "My car died on I-95 near exit 12 and your app shows no available tow trucks! I’m stranded with my kids in freezing cold—need help ASAP!", "sentiment": "urgent_negative"},
    {"text": "Stuck in the desert outside Phoenix with engine smoking and no cell service. Need towing plz, it’s emergncy!", "sentiment": "urgent_negative"},
    {"text": "Why are there no mechanics available in downtown Detroit? My engine seized—I’m about to be late for surgery!", "sentiment": "urgent_negative"},
    {"text": "Your app matched me with a tow but it cancelled after 5min! I’m on a dark freeway shoulder, send someone else NOW!", "sentiment": "urgent_negative"},
    {"text": "Smoke coming from under my hood on the Golden Gate Bridge. I feel unsafe—dispatch emergency mechanic immediately!", "sentiment": "urgent_negative"},
    {"text": "Tow ETA says 45 min but traffic is gridlocked—I can’t wait that long on this busy ramp!", "sentiment": "urgent_negative"},
    {"text": "Car battery died on remote mountain road in Colorado with wolves nearby. Need mobile mechanic ASAP!", "sentiment": "urgent_negative"},
    {"text": "Got rear-ended on a deserted highway in Alabama; my car won't start and no one’s online to help!", "sentiment": "urgent_negative"},
    {"text": "Brakes failed on steep hill in San Francisco—I'm sliding toward traffic! Send help NOW!", "sentiment": "urgent_negative"},
    {"text": "I’m stranded in a bad neighborhood in Chicago and your app finds ZERO providers—I'm scared!", "sentiment": "urgent_negative"},
    {"text": "Tow provider lost my location and is nowhere to be seen! I'm stuck on I-70 with semis zooming past!", "sentiment": "urgent_negative"},
    {"text": "My check engine light just burst into flames in heavy rain. Please match me with the highest-rated tow ASAP!", "sentiment": "urgent_negative"},
    {"text": "App crashed when I tried to rebook after cancellation—I need a tow now or I'm stuck!", "sentiment": "urgent_negative"},
    {"text": "Engine locked up in middle of busy Avenue in NYC. People honking, I'm terrified—help!", "sentiment": "urgent_negative"},
    {"text": "I’m stuck at 2 AM on a rural road in Texas with no lights. This is not acceptable—need service NOW!", "sentiment": "urgent_negative"},
    {"text": "Transmission just died on I-5 in Seattle during rush hour! No tow available on your platform!", "sentiment": "urgent_negative"},
    {"text": "I smell gasoline leak under my car on a bridge. Could blow any second!", "sentiment": "urgent_negative"},
    {"text": "Tow guys never showed—been waiting 1 HOUR in cold rain. Please resend someone IMMEDIATELY!", "sentiment": "urgent_negative"},
    {"text": "My kids are crying in the backseat on a busy interstate—need mobile mechanic ASAP or I’m calling 911!", "sentiment": "urgent_negative"},
    {"text": "App says provider is 2 miles away but tracking pin hasn’t moved in 15 min! I’m in danger here!", "sentiment": "urgent_negative"},
    {"text": "Flat tire in middle of highway at night. Can’t fix it myself. Send urgent tire change NOW!", "sentiment": "urgent_negative"},
    {"text": "Car overheated on desert highway—waiting in 110 °F with no water. Urgent help needed!", "sentiment": "urgent_negative"},
    {"text": "Provider just canceled last second, now my car is blocking traffic downtown. I’m losing it!", "sentiment": "urgent_negative"},
    {"text": "I’m stranded on a backroad with no signal and I can’t book through the app!", "sentiment": "urgent_negative"},
    {"text": "Hit a deer on remote highway. Radiator leaking—need emergency tow or I’ll overheat!", "sentiment": "urgent_negative"},
    {"text": "My mobile mechanic arrived with wrong parts. I’m still stranded in a bad part of town!", "sentiment": "urgent_negative"},
    {"text": "AC died in 100 °F heat with my toddler inside. This is an emergency!", "sentiment": "urgent_negative"},
    {"text": "I need a flatbed tow, not a standard hook lift! Your platform keeps sending wrong type!", "sentiment": "urgent_negative"},
    {"text": "App doesn’t show any gas delivery options—running fuel low on a dangerous road!", "sentiment": "urgent_negative"},
    {"text": "I was matched with a 2-star provider and they just backed out. Can’t trust your app in emergencies!", "sentiment": "urgent_negative"},
    {"text": "Car is sliding backward off a mountain curve! Send help NOW or I’ll roll!", "sentiment": "urgent_negative"},
    {"text": "Tow ETA keeps jumping back to 1 h! I can’t wait that long on an active rail crossing!", "sentiment": "urgent_negative"},
    {"text": "Provider’s phone is unreachable and I’m stuck on a one-lane coastal road!", "sentiment": "urgent_negative"},
    {"text": "Just heard a loud pop under the hood. Belts flying apart. Need urgent inspection!", "sentiment": "urgent_negative"},
    {"text": "App payment failed while booking emergency tow—why is this happening?!", "sentiment": "urgent_negative"},
    {"text": "Lost power steering on a busy highway. I’m about to crash. Help me!", "sentiment": "urgent_negative"},
    {"text": "Tow driver went offline mid-route! I’m stranded at exit 22 in Indiana!", "sentiment": "urgent_negative"},
    {"text": "My car’s fuel filter clogged on a dark country road—no mechanics near me!", "sentiment": "urgent_negative"},
    {"text": "Tow truck is coming from 30 miles away but my car is in pieces on the shoulder!", "sentiment": "urgent_negative"},
    {"text": "Car rolled over embankment in rural Minnesota. I’m stuck and phone may die!", "sentiment": "urgent_negative"},
    {"text": "App glitched and I can’t confirm a booking—engine just stalled on busy freeway!", "sentiment": "urgent_negative"},
    {"text": "Vehicle fire in engine bay, flames rising! Please send emergency tow NOW!", "sentiment": "urgent_negative"},
    {"text": "Tow just cancelled again, this is the third time! I’m on a curve with no guardrail!", "sentiment": "urgent_negative"},
    {"text": "My SUV slipped on black ice and slid into a ditch. I can’t move in subzero temps!", "sentiment": "urgent_negative"},
    {"text": "Provider shows ETA 10 min but traffic on GPS is red. I’m still roadside!", "sentiment": "urgent_negative"},
    {"text": "Car alarm keeps blaring on this deserted road. At risk of mugging. Need help ASAP!", "sentiment": "urgent_negative"},
    {"text": "My gear shift locked in drive on a bridge—I’m exposed and cars swerving by!", "sentiment": "urgent_negative"},
    {"text": "Just sideswiped at high speed—car is totaled and I can’t move. I need rescue!", "sentiment": "urgent_negative"},
    {"text": "Tow app shows provider in Manhattan but I’m in Queens—why can’t it find me?!", "sentiment": "urgent_negative"},
    {"text": "My phone battery is at 2% and I’m stuck with a blown tire on a remote backroad!", "sentiment": "urgent_negative"}
  ]